NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
    uint8_t count = preferences.getUChar(ESPNOW_NVS_ROVER_COUNT_KEY, 0);
    for (uint8_t index = 0; index < count && index < ESPNOW_MAX_PAIRED_ROVERS; ++index) {
        char key[12] = {};
        uint8_t storedMac[6] = {};
        makeRoverMacKey(index, key, sizeof(key));
        if (preferences.getBytesLength(key) == 6 &&
            preferences.getBytes(key, storedMac, sizeof(storedMac)) == 6 &&
            macEquals(storedMac, mac)) {
            preferences.end();
            addRoverRuntimePeer(mac, true);
            return true;
        }
    }

    if (count >= ESPNOW_MAX_PAIRED_ROVERS) {
        preferences.end();
        Serial.println("[BASE][PAIR][ERROR] NVS rover list full");
        return false;
    }

    char key[12] = {};
    makeRoverMacKey(count, key, sizeof(key));
    const bool ok = preferences.putBytes(key, mac, 6) == 6 &&
                    preferences.putUChar(ESPNOW_NVS_ROVER_COUNT_KEY, count + 1) == 1;
    preferences.end();

    if (ok) {
        addRoverRuntimePeer(mac, true);
    }
    return ok;
}

void loadStoredRovers()
{
    Preferences preferences;
    if (!preferences.begin(ESPNOW_NVS_NAMESPACE, true)) {
        Serial.println("[BASE][PAIR][WARN] Khong mo duoc NVS de doc Rover MAC");
        return;
    }

    const uint8_t count = preferences.getUChar(ESPNOW_NVS_ROVER_COUNT_KEY, 0);
    for (uint8_t index = 0; index < count && index < ESPNOW_MAX_PAIRED_ROVERS; ++index) {
        char key[12] = {};
        uint8_t mac[6] = {};
        makeRoverMacKey(index, key, sizeof(key));
        if (preferences.getBytesLength(key) == 6 &&
            preferences.getBytes(key, mac, sizeof(mac)) == 6 &&
            macIsConfigured(mac)) {
            addRoverRuntimePeer(mac, true);
            Serial.println("[BASE][PAIR] Loaded Rover MAC from NVS: " + macToString(mac));
        }
    }
    preferences.end();
}

bool configureMaxTxPower()
{
    if (!WiFi.setTxPower(WIFI_POWER_19_5dBm)) {
        Serial.println("[BASE][WIFI][ERROR] Khong set duoc TX power 19.5 dBm");
        return false;
    }

    int8_t actualPower = 0;
    const esp_err_t result = esp_wifi_get_max_tx_power(&actualPower);
    if (result == ESP_OK) {
        Serial.printf("[BASE][WIFI] TX power fixed raw=%d dBm=%.2f\n",
                      actualPower,
                      actualPower / 4.0f);
    } else {
        Serial.printf("[BASE][WIFI][WARN] Khong doc duoc TX power: %d\n", result);
    }
    return true;
}

void drainSendCallbackSemaphore()
{
    while (xSemaphoreTake(sendCallbackSemaphore, 0) == pdTRUE) {
    }
}

bool sendControlPacket(const uint8_t* mac, const uint8_t* packet, size_t packetLength)
{
    if (espnowSendMutex == nullptr ||
        xSemaphoreTake(espnowSendMutex, pdMS_TO_TICKS(ESPNOW_SEND_TIMEOUT_MS)) != pdTRUE) {
        return false;
    }

    drainSendCallbackSemaphore();
    lastSendSucceeded = false;
    const esp_err_t sendResult = esp_now_send(mac, packet, packetLength);
    if (sendResult != ESP_OK) {
        xSemaphoreGive(espnowSendMutex);
        Serial.printf("[BASE][PAIR][ERROR] esp_now_send control failed: %d\n", sendResult);
        return false;
    }

    xSemaphoreTake(sendCallbackSemaphore, pdMS_TO_TICKS(ESPNOW_SEND_TIMEOUT_MS));
    drainSendCallbackSemaphore();
    xSemaphoreGive(espnowSendMutex);
    return true;
}

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onDataSent(const wifi_tx_info_t*, esp_now_send_status_t status)
#else
void onDataSent(const uint8_t*, esp_now_send_status_t status)
#endif
{
    lastSendSucceeded = (status == ESP_NOW_SEND_SUCCESS);
    if (sendCallbackSemaphore != nullptr) {
        xSemaphoreGive(sendCallbackSemaphore);
    }
}

void queuePairResponse(const uint8_t* sourceMac, const uint8_t* data, int length)
{
    if (!ESPNOW_PAIRING_ENABLED || sourceMac == nullptr || data == nullptr ||
        length != static_cast<int>(sizeof(RtcmEspNowPairResponse))) {
        return;
    }

    bool active = false;
    portENTER_CRITICAL(&pairingMux);
    active = pairingActive;
    if (active) {
        std::memcpy(&pendingPairResponsePacket, data, sizeof(pendingPairResponsePacket));
        std::memcpy(pendingPairResponseMac, sourceMac, sizeof(pendingPairResponseMac));
        pendingPairResponse = true;
    }
    portEXIT_CRITICAL(&pairingMux);
}

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onDataReceived(const esp_now_recv_info_t* info, const uint8_t* data, int length)
{
    const uint8_t* sourceMac = info == nullptr ? nullptr : info->src_addr;
#else
void onDataReceived(const uint8_t* sourceMac, const uint8_t* data, int length)
#endif
{
    if (sourceMac == nullptr || data == nullptr ||
        length < static_cast<int>(sizeof(RtcmEspNowCommonHeader))) {
        incrementStat(&BaseEspnowStats::ackPacketsInvalid);
        return;
    }

    RtcmEspNowCommonHeader common{};
    std::memcpy(&common, data, sizeof(common));
    if (common.magic != RTCM_ESPNOW_MAGIC || common.version != RTCM_ESPNOW_VERSION) {
        incrementStat(&BaseEspnowStats::ackPacketsInvalid);
        return;
    }

    if (common.packetType == RTCM_ESPNOW_PACKET_TYPE_PAIR_RESPONSE) {
        queuePairResponse(sourceMac, data, length);
        return;
    }

    if (length != static_cast<int>(sizeof(RtcmEspNowAck))) {
        incrementStat(&BaseEspnowStats::ackPacketsInvalid);
        return;
    }

    RtcmEspNowAck ack{};
    std::memcpy(&ack, data, sizeof(ack));
    if (ack.packetType != RTCM_ESPNOW_PACKET_TYPE_FRAME_ACK ||
        ack.status != RTCM_ESPNOW_ACK_STATUS_WRITTEN) {
        incrementStat(&BaseEspnowStats::ackPacketsInvalid);
        return;
    }

    if (!waitingForFrameAck || !macEquals(sourceMac, expectedAckMac) ||
        ack.streamId != expectedAckStreamId ||
        ack.frameSequence != expectedAckSequence) {
        incrementStat(&BaseEspnowStats::ackPacketsInvalid);
        return;
    }

    incrementStat(&BaseEspnowStats::ackPacketsReceived);
    if (frameAckSemaphore != nullptr) {
        xSemaphoreGive(frameAckSemaphore);
    }
}

bool frameDeadlineExpired(uint32_t startedAt)
{
    return millis() - startedAt >= ESPNOW_FRAME_SEND_DEADLINE_MS;
}

